import pandas as pd
import csv
f = open('ChatBotData copy.csv','w',encoding='utf-8',newline='')
wr = csv.writer(f)
wr.writerow(['Q','A','label'])
menu=['고기국수','쌀국수','동파육','탕수육','비빔밥','리조또','피자','버거킹','칼국수','비빔국수','막국수','잔치국수','냉면','콩국수','비빔냄면','짜장면','짬뽕','불고기','돼지갈비','닭갈비','떡갈비','삼겹살','뒷고기','제육볶음','두루치기','닭강정','닭도리탕','닭발','양념치킨','간장치킨','보쌈','편육','백숙','육회','옻닭','찜닭','순대','간장게장','매운탕','아귀찜','해물찜','회덮밥','꼼장어볶음','부침개','파전','갈비탕','닭곰탕','도가니탕','내장탕','알탕','추어탕','매운탕','파스타','삼계탕','부대찌개','초밥','라멘','라면','샌드위치','마카롱','순두부찌개','된장찌개','떡볶이','감자탕','카레','쭈꾸미볶음']
print(len(menu))
# for i in range(len(menu)):
#     if i % 3==0:
#         a='오늘 뭐 먹지?'
#     elif i % 3==1:
#         a='뭐 먹지'
#     else:
#         a = "점심 뭐 먹지"
#     if i % 3==0:
#         b=menu[i]+' 어때요'
#     elif i % 3==1:
#         b='오늘은 '+menu[i]+' 먹어요!'
#     else:
#         b=menu[i]+' 추천해요'
#     c=0
#     wr.writerow([a,b,c])